## vscode extensions installed by default
# empty lines and starting from '#' are ignored

# python + jupyter notebooks: https://open-vsx.org/extension/ms-python/python
ms-python.python

# Jupyter notebook support: https://open-vsx.org/extension/ms-toolsai/jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# GitLens: https://open-vsx.org/extension/eamodio/gitlens
eamodio.gitlens

# BetterComments: https://open-vsx.org/extension/aaron-bond/better-comments
aaron-bond.better-comments

# autoDocstring, https://open-vsx.org/extension/njpwerner/autodocstring
njpwerner.autodocstring

# Tabnine AI Autocomplete, https://open-vsx.org/extension/TabNine/tabnine-vscode
tabnine.tabnine-vscode

## more to consider:
# CodeTogether to live share your VSCode and coding sessions
#genuitecllc.codetogether
# Prettier, https://open-vsx.org/extension/esbenp/prettier-vscode
#esbenp.prettier-vscode
